In [1]:
import pandas as pd
drinks=pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [2]:
# series have an index and it is come from the dataframe
drinks.continent.head()

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: object

In [3]:
drinks.set_index('country',inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [4]:
# notes that we pull the continent but the countery comes as an index
drinks.continent.head()

country
Afghanistan      Asia
Albania        Europe
Algeria        Africa
Andorra        Europe
Angola         Africa
Name: continent, dtype: object

In [9]:
drinks.continent.value_counts().values

array([53, 45, 44, 23, 16, 12], dtype=int64)

In [11]:
drinks.continent.value_counts()['Africa']

53

In [10]:
drinks.continent.value_counts().sort_index()

Africa           53
Asia             44
Europe           45
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [13]:
# Create a series with named index
people=pd.Series([300000,8500],index=['Albania','Andorra'],name='population')
people

Albania    300000
Andorra      8500
Name: population, dtype: int64

In [14]:
# we want to find the total beer_serving for each country in people series
#so will multiply the beer_servings by people population
drinks.beer_servings * people

Afghanistan           NaN
Albania        26700000.0
Algeria               NaN
Andorra         2082500.0
Angola                NaN
                  ...
Venezuela             NaN
Vietnam               NaN
Yemen                 NaN
Zambia                NaN
Zimbabwe              NaN
Length: 193, dtype: float64

In [15]:
# we need to combine our new series (people) with drinks dataframe
pd.concat([drinks,people],axis=1).head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,population
Afghanistan,0,0,0,0.0,Asia,NaN
Albania,89,132,54,4.9,Europe,300000.0
Algeria,25,0,14,0.7,Africa,NaN
Andorra,245,138,312,12.4,Europe,8500.0
Angola,217,57,45,5.9,Africa,NaN